app/controllers/citas_controller.rb

  def show
    @cita = Cita.find(params[:id])
---
SELECT "cita".* FROM "cita" WHERE "cita"."id" = ? LIMIT ?  [["id", 9], ["LIMIT", 1]]

  def create
    @cita = Cita.new(
      mascota: params[:mascota],
      edad: params[:edad],
      raza: params[:raza],
      fecha: params[:fecha],
      hora: params[:hora],
      amo: params[:amo]
    )
    if @cita.save
---
INSERT INTO "cita" ("mascota", "edad", "raza", "fecha", "hora", "amo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)